performance-test/results/repor/statistics.json
{
  "List Transactions" : {
    "transaction" : "List Transactions",
    "sampleCount" : 5000,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 274.1853999999997,
    "medianResTime" : 247.0,
    "minResTime" : 0.0,
    "maxResTime" : 1439.0,
    "pct1ResTime" : 560.0,
    "pct2ResTime" : 617.0,
    "pct3ResTime" : 768.9699999999993,
    "throughput" : 60.39960377859921,
    "receivedKBytesPerSec" : 79.92319765694837,
    "sentKBytesPerSec" : 0.0
  },
  "Modify Transaction" : {
    "transaction" : "Modify Transaction",
    "sampleCount" : 5000,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 14.852200000000046,
    "medianResTime" : 6.0,
    "minResTime" : 0.0,
    "maxResTime" : 434.0,
    "pct1ResTime" : 33.0,
    "pct2ResTime" : 52.0,
    "pct3ResTime" : 133.0,
    "throughput" : 60.49606775559589,
    "receivedKBytesPerSec" : 16.1762467861464,
    "sentKBytesPerSec" : 0.0
  },
  "Delete Transaction" : {
    "transaction" : "Delete Transaction",
    "sampleCount" : 5000,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 10.688399999999984,
    "medianResTime" : 4.0,
    "minResTime" : 0.0,
    "maxResTime" : 575.0,
    "pct1ResTime" : 26.0,
    "pct2ResTime" : 33.0,
    "pct3ResTime" : 75.0,
    "throughput" : 60.49753170070661,
    "receivedKBytesPerSec" : 16.1766382353475,
    "sentKBytesPerSec" : 0.0
  },
  "Total" : {
    "transaction" : "Total",
    "sampleCount" : 23000,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 85.87773913043478,
    "medianResTime" : 10.0,
    "minResTime" : 0.0,
    "maxResTime" : 1439.0,
    "pct1ResTime" : 387.0,
    "pct2ResTime" : 512.0,
    "pct3ResTime" : 647.9900000000016,
    "throughput" : 277.115111207499,
    "receivedKBytesPerSec" : 146.9779156952577,
    "sentKBytesPerSec" : 0.0
  },
  "Create Transaction" : {
    "transaction" : "Create Transaction",
    "sampleCount" : 5000,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 9.78299999999997,
    "medianResTime" : 4.0,
    "minResTime" : 0.0,
    "maxResTime" : 573.0,
    "pct1ResTime" : 23.0,
    "pct2ResTime" : 30.0,
    "pct3ResTime" : 62.969999999999345,
    "throughput" : 60.44779728226703,
    "receivedKBytesPerSec" : 16.168994756909186,
    "sentKBytesPerSec" : 0.0
  },
  "Complete Transaction Flow" : {
    "transaction" : "Complete Transaction Flow",
    "sampleCount" : 5000,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 309.5090000000001,
    "medianResTime" : 271.5,
    "minResTime" : 3.0,
    "maxResTime" : 1449.0,
    "pct1ResTime" : 609.0,
    "pct2ResTime" : 683.9499999999998,
    "pct3ResTime" : 857.9799999999996,
    "throughput" : 60.350758609035715,
    "receivedKBytesPerSec" : 128.27638610604834,
    "sentKBytesPerSec" : 0.0
  },
  "Query Transaction List" : {
    "transaction" : "Query Transaction List",
    "sampleCount" : 1500,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 273.2040000000001,
    "medianResTime" : 222.0,
    "minResTime" : 0.0,
    "maxResTime" : 959.0,
    "pct1ResTime" : 545.0,
    "pct2ResTime" : 595.0,
    "pct3ResTime" : 682.97,
    "throughput" : 34.602874345428965,
    "receivedKBytesPerSec" : 26.863882925500015,
    "sentKBytesPerSec" : 0.0
  },
  "Batch Create Transaction" : {
    "transaction" : "Batch Create Transaction",
    "sampleCount" : 1500,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 11.891333333333328,
    "medianResTime" : 4.0,
    "minResTime" : 0.0,
    "maxResTime" : 385.0,
    "pct1ResTime" : 28.0,
    "pct2ResTime" : 46.0,
    "pct3ResTime" : 97.97000000000003,
    "throughput" : 34.735891438760625,
    "receivedKBytesPerSec" : 9.419916945036242,
    "sentKBytesPerSec" : 0.0
  }
}