performance-test/results/report/statistics.json
{
  "List Transactions" : {
    "transaction" : "List Transactions",
    "sampleCount" : 5000,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 2.058600000000002,
    "medianResTime" : 1.0,
    "minResTime" : 0.0,
    "maxResTime" : 32.0,
    "pct1ResTime" : 4.0,
    "pct2ResTime" : 6.0,
    "pct3ResTime" : 14.989999999999782,
    "throughput" : 108.78078496214428,
    "receivedKBytesPerSec" : 149.35714380411844,
    "sentKBytesPerSec" : 0.0
  },
  "Modify Transaction" : {
    "transaction" : "Modify Transaction",
    "sampleCount" : 5000,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 0.7843999999999994,
    "medianResTime" : 1.0,
    "minResTime" : 0.0,
    "maxResTime" : 13.0,
    "pct1ResTime" : 2.0,
    "pct2ResTime" : 2.0,
    "pct3ResTime" : 3.0,
    "throughput" : 108.78788538108395,
    "receivedKBytesPerSec" : 29.084249927928028,
    "sentKBytesPerSec" : 0.0
  },
  "Delete Transaction" : {
    "transaction" : "Delete Transaction",
    "sampleCount" : 5000,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 0.6498000000000007,
    "medianResTime" : 1.0,
    "minResTime" : 0.0,
    "maxResTime" : 15.0,
    "pct1ResTime" : 1.0,
    "pct2ResTime" : 2.0,
    "pct3ResTime" : 2.0,
    "throughput" : 108.79498672701162,
    "receivedKBytesPerSec" : 29.08183490904739,
    "sentKBytesPerSec" : 0.0
  },
  "Total" : {
    "transaction" : "Total",
    "sampleCount" : 23000,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 0.980869565217392,
    "medianResTime" : 1.0,
    "minResTime" : 0.0,
    "maxResTime" : 32.0,
    "pct1ResTime" : 2.0,
    "pct2ResTime" : 3.0,
    "pct3ResTime" : 7.0,
    "throughput" : 498.13739928961274,
    "receivedKBytesPerSec" : 270.2270179979208,
    "sentKBytesPerSec" : 0.0
  },
  "Create Transaction" : {
    "transaction" : "Create Transaction",
    "sampleCount" : 5000,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 0.6714000000000002,
    "medianResTime" : 1.0,
    "minResTime" : 0.0,
    "maxResTime" : 25.0,
    "pct1ResTime" : 1.0,
    "pct2ResTime" : 2.0,
    "pct3ResTime" : 3.0,
    "throughput" : 108.66966594944687,
    "receivedKBytesPerSec" : 29.057844183999478,
    "sentKBytesPerSec" : 0.0
  },
  "Complete Transaction Flow" : {
    "transaction" : "Complete Transaction Flow",
    "sampleCount" : 5000,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 4.164200000000005,
    "medianResTime" : 3.0,
    "minResTime" : 0.0,
    "maxResTime" : 36.0,
    "pct1ResTime" : 8.0,
    "pct2ResTime" : 10.0,
    "pct3ResTime" : 19.0,
    "throughput" : 108.64369214723393,
    "receivedKBytesPerSec" : 236.3069055288775,
    "sentKBytesPerSec" : 0.0
  },
  "Query Transaction List" : {
    "transaction" : "Query Transaction List",
    "sampleCount" : 1500,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 0.7006666666666661,
    "medianResTime" : 1.0,
    "minResTime" : 0.0,
    "maxResTime" : 14.0,
    "pct1ResTime" : 1.0,
    "pct2ResTime" : 1.0,
    "pct3ResTime" : 2.0,
    "throughput" : 50.82506014298784,
    "receivedKBytesPerSec" : 40.49162392420289,
    "sentKBytesPerSec" : 0.0
  },
  "Batch Create Transaction" : {
    "transaction" : "Batch Create Transaction",
    "sampleCount" : 1500,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 0.4586666666666673,
    "medianResTime" : 0.0,
    "minResTime" : 0.0,
    "maxResTime" : 12.0,
    "pct1ResTime" : 1.0,
    "pct2ResTime" : 1.0,
    "pct3ResTime" : 2.0,
    "throughput" : 50.82161612739285,
    "receivedKBytesPerSec" : 13.775238755717432,
    "sentKBytesPerSec" : 0.0
  }
}